IdeaRS.OpenModel.Concrete.ExposureClassEc2
Type of exposure class

IdeaRS.OpenModel.Concrete.ExposureClassEc2.X0
No risk of corrosion or attack - very dry

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XC1
Corrosion induced by carbonation - dry or permanently wet

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XC2
Corrosion induced by carbonation - wet, rarely dry

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XC3
Corrosion induced by carbonation - moderate humidity

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XC4
Corrosion induced by carbonation - cyclic wet and dry

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XD1
Corrosion induced by chlorides - moderate humidity

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XD2
Corrosion induced by chlorides - wet, rarely dry

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XD3
Corrosion induced by chlorides - cyclic wet and dry

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XS1
Corrosion induced by chlorides from sea water - exposed to airborne salt but not in direct contact with sea water

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XS2
Corrosion induced by chlorides from sea water - permanently submerged

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XS3
Corrosion induced by chlorides from sea water - tidal, splash and spray zones

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XF1
Freeze/Thaw Attack - moderate water saturation, without de-icing agent

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XF2
Freeze/Thaw Attack - moderate water saturation, with de-icing agent

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XF3
Freeze/Thaw Attack - high water saturation, without de-icing agents

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XF4
Freeze/Thaw Attack - high water saturation with de-icing agents or sea water

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XA1
Chemical attack - slightly aggressive chemical environment according to EN 206-1, Table 2

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XA2
Chemical attack - moderately aggressive chemical environment according to EN 206-1, Table 2

IdeaRS.OpenModel.Concrete.ExposureClassEc2.XA3
Chemical attack - highly aggressive chemical environment according to EN 206-1, Table 2